# ── Taps ─────────────────────────────────────────────────────────────────────
tap "homebrew/cask-versions"
tap "jandedobbeleer/oh-my-posh"
tap "cilium/cilium"
tap "9gag/9router"

# ── Brew ────────────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "tree"
brew "jq"
brew "zoxide"
brew "fzf"
brew "lazygit"
brew "lazydocker"
brew "thefuck"
brew "xh"
brew "php"
brew "composer"
brew "openjdk"
brew "starship"
brew "btop"
brew "atuin"
brew "mkcert"
brew "scrcpy"

# ── Cask ────────────────────────────────────────────────────────────────────
cask "ghostty"
cask "brave-browser"
cask "android-studio"
cask "android-platform-tools"
cask "orbstack"

# ── Mac App Store ───────────────────────────────────────────────────────────
# mas "Xcode", id: 497799835
